Tekla Open API Reference for Tekla Structures 2025
Surfacing.Representation Enumeration
 The surfacing representations.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum Representation
Public Enumeration Representation
Members
Member name | Value | Description
Outline | 1 |  The outline representation.
Symbol | 2 |  The symbol representation.
WorkshopForm | 4 |  The workshop form representation.
Exact | 8 |  The exact representation.
BoundingBox | 16 |  The bounding box representation.
BaseBox | 32 |  The base box representation.
See Also
Reference
Tekla.Structures.Drawing Namespace